roboter/Hardware/GigaDevice/GD32VF103/GD-Link Programmer/OptionBytesXML/GD32E50x.xml
<!--NodeType> complement !=FFFF is complement byte</NodeType-->
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<OPBytesBlocks>
    <OPBytesBlock baseAddress="0x1FFFF800" length="16"/>
</OPBytesBlocks>
<OPBytes baseAddress="0x1FFFF800" length="16">
    <OPByte>
        <name>SPC</name>
        <displayName>SPC</displayName>
        <addressOffset>0x0</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xA5</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>SPC</name>
                <brief>Option byte security protection value</brief>
                <description>Option byte security protection value&#x000A;0xA5 : no security protection&#x000A;any value except 0xA5 or 0xCC : protection level low&#x000A;0xCC : protection level high</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>SPC_N</name>
        <displayName>SPC_N</displayName>
        <addressOffset>0x1</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x5A</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>SPC_N</name>
                <brief>SPC complement value</brief>
                <description>SPC complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>USER</name>
        <displayName>USER</displayName>
        <addressOffset>0x2</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
			<field>
                <name>BOR_TH</name>
                <brief>Brown out reset threshold</brief>
                <description>BOR_TH&#x000A;00: BOR Level 3, brownout threshold level 3&#x000A;01: BOR Level 2, brownout threshold level 2&#x000A;10: BOR Level 1, brownout threshold level 1&#x000A;11: BOR off</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>nRST_STDBY</name>
                <brief>Generate a reset instead of entering standby mode</brief>
                <description>nRST_STDBY&#x000A;0: generate a reset instead of entering standby mode&#x000A;1: no reset when entering standby mode</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nRST_DPSLP</name>
                <brief>Generate a reset instead of entering Deep-sleep mode</brief>
                <description>nRST_DPSLP&#x000A;0: generate a reset instead of entering Deep-sleep mode&#x000A;1: no reset when entering Deep-sleep mode</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nWDG_HW</name>
                <brief>Hardware free watchdog</brief>
                <description>nWDG_HW&#x000A;0: hardware free watchdog&#x000A;1: software free watchdog</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>USER_N</name>
        <displayName>USER_N</displayName>
        <addressOffset>0x3</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x2</complement>
        <fields>
            <field>
                <name>USER_N</name>
                <brief>USER complement value</brief>
                <description>USER complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA[7:0]</name>
        <displayName>DATA[7:0]</displayName>
        <addressOffset>0x4</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>DATA[7:0]</name>
                <brief>user defined data bit 7 to 0</brief>
                <description>user defined data bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA_N[7:0]</name>
        <displayName>DATA_N[7:0]</displayName>
        <addressOffset>0x5</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x4</complement>
        <fields>
            <field>
                <name>DATA_N[7:0]</name>
                <brief>DATA complement value bit 7 to 0</brief>
                <description>DATA complement value bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA[15:8]</name>
        <displayName>DATA[15:8]</displayName>
        <addressOffset>0x6</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>DATA[15:8]</name>
                <brief>user defined data bit 15 to 8</brief>
                <description>user defined data bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA_N[15:8]</name>
        <displayName>DATA_N[15:8]</displayName>
        <addressOffset>0x7</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x6</complement>
        <fields>
            <field>
                <name>DATA_N[15:8]</name>
                <brief>DATA complement value bit 15 to 8</brief>
                <description>DATA complement value bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>WP[7:0]</name>
        <displayName>WP[7:0]</displayName>
        <addressOffset>0x8</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>WP[7]</name>
                <brief>0x0800E000~0x0800FFFF</brief>
                <description>Page Erase/Program Protection bit 7(0x0800E000~0x0800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[6]</name>
                <brief>0x0800C000~0x0800DFFF</brief>
                <description>Page Erase/Program Protection bit 6(0x0800C000~0x0800DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[5]</name>
                <brief>0x0800A000~0x0800BFFF</brief>
                <description>Page Erase/Program Protection bit 5(0x0800A000~0x0800BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[4]</name>
                <brief>0x08008000~0x08009FFF</brief>
                <description>Page Erase/Program Protection bit 4(0x08008000~0x08009FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[3]</name>
                <brief>0x08006000~0x08007FFF</brief>
                <description>Page Erase/Program Protection bit 3(0x08006000~0x08007FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[2]</name>
                <brief>0x08004000~0x08005FFF</brief>
                <description>Page Erase/Program Protection bit 2(0x08004000~0x08005FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[1]</name>
                <brief>0x08002000~0x08003FFF</brief>
                <description>Page Erase/Program Protection bit 1(0x08002000~0x08003FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[0]</name>
                <brief>0x08000000~0x08001FFF</brief>
                <description>Page Erase/Program Protection bit 0(0x08000000~0x08001FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>WP_N[7:0]</name>
        <displayName>WP_N[7:0]</displayName>
        <addressOffset>0x9</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x8</complement>
        <fields>
            <field>
                <name>WP_N[7:0]</name>
                <brief>WP complement value bit 7 to 0</brief>
                <description>WP complement value bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>WP[15:8]</name>
        <displayName>WP[15:8]</displayName>
        <addressOffset>0xA</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>WP[15]</name>
                <brief>0x0801E000~0x0801FFFF</brief>
                <description>Page Erase/Program Protection bit 15(0x0801D000~0x0801EFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[14]</name>
                <brief>0x0801C000~0x0801DFFF</brief>
                <description>Page Erase/Program Protection bit 14(0x0801B000~0x0801CFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[13]</name>
                <brief>0x0801A000~0x0801BFFF</brief>
                <description>Page Erase/Program Protection bit 13(0x08019000~0x0801AFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[12]</name>
                <brief>0x08018000~0x08019FFF</brief>
                <description>Page Erase/Program Protection bit 12(0x08018000~0x08018FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[11]</name>
                <brief>0x08016000~0x08017FFF</brief>
                <description>Page Erase/Program Protection bit 11(0x08016000~0x08017FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[10]</name>
                <brief>0x08014000~0x08015FFF</brief>
                <description>Page Erase/Program Protection bit 10(0x08014000~0x08015FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[9]</name>
                <brief>0x08012000~0x08013FFF</brief>
                <description>Page Erase/Program Protection bit 9(0x08012000~0x08013FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[8]</name>
                <brief>0x08010000~0x08011FFF</brief>
                <description>Page Erase/Program Protection bit 8(0x08010000~0x08011FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>WP_N[15:8]</name>
        <displayName>WP_N[15:8]</displayName>
        <addressOffset>0xB</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0xA</complement>
        <fields>
            <field>
                <name>WP_N[15:8]</name>
                <brief>WP complement value bit 15 to 8</brief>
                <description>WP complement value bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
	<OPByte>
        <name>WP[23:16]</name>
        <displayName>WP[23:16]</displayName>
        <addressOffset>0xC</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>WP[23]</name>
                <brief>0x0802E000~0x0802FFFF</brief>
                <description>Page Erase/Program Protection bit 23(0x0802D000~0x0802EFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[22]</name>
                <brief>0x0802C000~0x0802DFFF</brief>
                <description>Page Erase/Program Protection bit 22(0x0802B000~0x0802CFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[21]</name>
                <brief>0x0802A000~0x0802BFFF</brief>
                <description>Page Erase/Program Protection bit 21(0x08029000~0x0802AFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[20]</name>
                <brief>0x08028000~0x08029FFF</brief>
                <description>Page Erase/Program Protection bit 20(0x08027000~0x08028FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[19]</name>
                <brief>0x08026000~0x08027FFF</brief>
                <description>Page Erase/Program Protection bit 19(0x08025000~0x08026FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[18]</name>
                <brief>0x08024000~0x08025FFF</brief>
                <description>Page Erase/Program Protection bit 18(0x08023000~0x08024FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[17]</name>
                <brief>0x08022000~0x08023FFF</brief>
                <description>Page Erase/Program Protection bit 17(0x08021000~0x08022FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[16]</name>
                <brief>0x08020000~0x08021FFF</brief>
                <description>Page Erase/Program Protection bit 16(0x0801F000~0x08020FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>WP_N[23:16]</name>
        <displayName>WP_N[23:16]</displayName>
        <addressOffset>0xB</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0xD</complement>
        <fields>
            <field>
                <name>WP_N[23:16]</name>
                <brief>WP complement value bit 23 to 16</brief>
                <description>WP complement value bit 23 to 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
	<OPByte>
        <name>WP[31:24]</name>
        <displayName>WP[31:24]</displayName>
        <addressOffset>0xE</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>WP[31]</name>
                <brief>0x0803E000~0x0807FFFF</brief>
                <description>Page Erase/Program Protection bit 31(0x0805D000~0x0807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[30]</name>
                <brief>0x0803C000~0x0803DFFF</brief>
                <description>Page Erase/Program Protection bit 30(0x0805B000~0x0805CFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[29]</name>
                <brief>0x0803A000~0x0803BFFF</brief>
                <description>Page Erase/Program Protection bit 29(0x08059000~0x0805AFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[28]</name>
                <brief>0x08038000~0x08039FFF</brief>
                <description>Page Erase/Program Protection bit 28(0x08057000~0x08058FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[27]</name>
                <brief>0x08036000~0x08037FFF</brief>
                <description>Page Erase/Program Protection bit 27(0x08055000~0x08056FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[26]</name>
                <brief>0x08034000~0x08035FFF</brief>
                <description>Page Erase/Program Protection bit 26(0x08053000~0x08054FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[25]</name>
                <brief>0x08032000~0x08033FFF</brief>
                <description>Page Erase/Program Protection bit 25(0x08041000~0x08052FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[24]</name>
                <brief>0x08030000~0x08031FFF</brief>
                <description>Page Erase/Program Protection bit 24(0x0803F000~0x08040FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>WP_N[31:24]</name>
        <displayName>WP_N[31:24]</displayName>
        <addressOffset>0xF</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0xD</complement>
        <fields>
            <field>
                <name>WP_N[31:24]</name>
                <brief>WP complement value bit 31 to 24</brief>
                <description>WP complement value bit 31 to 24</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
</OPBytes>